#include "mechanics/magneticimpulse.hpp"
#include "cosmetics/player/exloads.hpp"
#include "gears/blastGaugeGears.hpp"
#include "gears/hangon.hpp"
#include "gears/hypersonic.hpp"
#include "gears/supermetal.hpp"
#include "handlers/menu/debugmenu/debugmenu.hpp"
#include "handlers/player/voicelines.hpp"
#include "lib/lib.hpp"
#include "lib/stdlib.hpp"
#include "mechanics/dash/flyhoopdash.hpp"
#include "mechanics/dash/grindraildash.hpp"
#include "riders/gamemode.hpp"
#include "riders/stage.hpp"
#include <ppu_intrinsics.h>
//#include "gears/hyperhangon.hpp"
#include "lib/animation.hpp"
#include "archetype/afterburner.hpp"
#include "handlers/player/specialflagtweaks.hpp"

struct LevelUpStarsObject1;
struct Particle_LevelUpStars;

namespace MagneticImpulse {
	std::array<MI::ImpulseData, MaxPlayerCount> impulseData;
	std::array<Matrix3x4F, MaxPlayerCount> PlayerPositionRotationMatrices;

	void playMaxMILine(const Player&player);
	void setMaxMIAnimation(Player &player);
	void levelUpStars(const Player&player);

	constexpr auto VoiceLinesPerChar = 3;
	constexpr m2darray<u8, std::to_underlying(Character::Total), VoiceLinesPerChar> VoiceLineIDs = {{
			{0x02}, // Sonic
			{0x02}, // Tails
			{0x02}, // Knuckles
			{0x02}, // Amy
			{0x02}, // Jet
			{0x02}, // Storm
			{0x02}, // Wave
			{0x02}, // Eggman
			{0x02}, // Cream
			{0x02}, // Rouge
			{0x02}, // Shadow
			{0x02}, // SuperSonic
			{0x02, 0x03, 19}, // Nights
			{0x02}, // Aiai
			{0x02}, // Ulala
			{}, // E10G
			{}, // E10R
			{0x08, 0x09, 0x0A}, // Silver
			{0x07, 0x08, 0x09}, // MetalSonic
			{0x02, 0x07}, // Emerl
			{0x08, 0x09}, // Blaze
			{0x07}, // Chaos
			{8, 9, 10} // Tikal
	}};
	constexpr m2darray<u8, EXLoadCount, VoiceLinesPerChar> ExLoadVoiceLineIDs = {{
			{},
			{}, // Perfect Nazo
			{}, // E10R
			{}, // Dark Sonic
			{12}, // Hyper Sonic
			{}, // Stardust Speeder
			{}, // Hyper HangOn
			{}, // The Professional
			{}, // Ollie King Gear
			{}, // Windmaster Jet
			{}, // Neo Metal
			{}, // E99
			{}, // The Beast
			{}, // E10B
			{8}, // Miku
			{}, // Metal Sonic Scarf
			{0x02, 0x03, 19}, // Reala
			{8}, // Gongon
	}};
} // namespace MagneticImpulse

void MagneticImpulse::playMaxMILine(const Player&player){
	const u8&character = player.character;
	const auto ID = player.hasCharacterExload() ? player.characterExload().id() : player.gearExload().id();
	const std::span MIVoiceLines = !player.hasExload() ? MI::VoiceLineIDs[character] : MI::ExLoadVoiceLineIDs[ID];

	u32 usedSlots = 0;
	while (usedSlots < MI::VoiceLinesPerChar) {
		// Get how many voicelines this character actually has
		if (MIVoiceLines[usedSlots] == 0) { break; }
		usedSlots++;
	}
	if (usedSlots == 0) { return; } // Character has no lines to play

	const u32 selectedLine = lbl_RNG_Number(usedSlots);
	Sound::PlaySound(player, MIVoiceLines[selectedLine]);
}

void MagneticImpulse::setMaxMIAnimation(Player &player) {
	constexpr auto TORNADO_CHEER_ANIMATIONID = 0x3B;
	constexpr auto RAIL_GRINDING_ANIMATIONID = 0x1B;

	if (player.state == PlayerState::Cruise ||
			player.state == PlayerState::TurbulenceRide ||
			player.state == PlayerState::Fly) {
		func_ClearPlayerMotionTable(player);
		func__RegistPlayerMotionTable(player, 1, 0, 10.0f, 0.0f);
		func__RegistPlayerMotionTable(player, TORNADO_CHEER_ANIMATIONID, 8, 1.0f, 0.0f);
		func_StartPlayerMotionTable(player);
	} else if (player.state == PlayerState::RailGrind) {
		func_ClearPlayerMotionTable(player);
		func__RegistPlayerMotionTable(player, RAIL_GRINDING_ANIMATIONID, 0, 10.0f, 0.0f);
		func__RegistPlayerMotionTable(player, TORNADO_CHEER_ANIMATIONID, 8, 1.0f, 0.0f);
		func_StartPlayerMotionTable(player);
	}
}

struct LevelUpStarsObject1{
	/* 0x0 */ u32 unk0;
	/* 0x4 */ u32 unk4;
	/* 0x8 */ u32 unk8;
	/* 0xC */ u32 unkC;
	/* 0x10 */ u32 unk10;
	/* 0x14 */ u32 unk14;
	/* 0x18 */ u32 unk18;
	/* 0x1C */ u32 unk1C;
	/* 0x20 */ u32 unk20;
	/* 0x24 */ u32 unk24;
	/* 0x28 */ u32 unk28;
	/* 0x2C */ u32 unk2C;
	/* 0x30 */ u32 unk30;
	/* 0x34 */ u32 unk34;
	/* 0x38 */ u32 unk38;
	/* 0x3C */ u32 unk3C;
	/* 0x40 */ u32 unk40;
	/* 0x44 */ u32 unk44;
	/* 0x48 */ const void *unk48;
	/* 0x4C */ u32 unk4C;
	/* 0x50 */ u32 unk50;
	/* 0x54 */ u32 unk54;
	/* 0x58 */ u32 unk58;
	/* 0x5C */ u32 unk5C;
	/* 0x60 */ void *unk60;
	/* 0x64 */ u32 unk64;
	/* 0x68 */ void *unk68;
	/* 0x6C */ u32 unk6C;
	/* 0x70 */ u8 unk70;
	/* 0x71 */ u8 unk71;
	/* 0x72 */ u8 unk72;
	/* 0x73 */ u8 unk73;
	/* 0x74 */ u32 unk74;
	/* 0x78 */ u32 unk78;
	/* 0x7C */ u32 unk7C;
};

struct Particle_LevelUpStars {
	/* 0x0 */ u32 unk0;
	/* 0x4 */ u32 unk4;
	/* 0x8 */ u32 unk8;
	/* 0xC */ u32 unkC;
	/* 0x10 */ u32 unk10;
	/* 0x14 */ u32 unk14;
	/* 0x18 */ u32 unk18;
	/* 0x1C */ u32 unk1C;
	/* 0x20 */ u32 unk20;
	/* 0x24 */ u32 unk24;
	/* 0x28 */ u32 unk28;
	/* 0x2C */ u32 unk2C;
	/* 0x30 */ u32 unk30;
	/* 0x34 */ u32 unk34;
	/* 0x38 */ u32 unk38;
	/* 0x3C */ u32 unk3C;
	/* 0x40 */ u32 unk40;
	/* 0x44 */ u32 unk44;
	/* 0x48 */ u32 unk48;
	/* 0x4C */ u32 unk4C;
	/* 0x50 */ u32 unk50;
	/* 0x54 */ u32 unk54;
	/* 0x58 */ u32 unk58;
	/* 0x5C */ u32 unk5C;
	/* 0x60 */ u32 unk60;
	/* 0x64 */ u32 unk64;
	/* 0x68 */ u32 unk68;
	/* 0x6C */ u32 unk6C;
	/* 0x70 */ u32 unk70;
	/* 0x74 */ u32 unk74;
	/* 0x78 */ u32 unk78;
	/* 0x7C */ u32 unk7C;
	/* 0x80 */ u32 unk80;
	/* 0x84 */ u32 unk84;
	/* 0x88 */ u32 unk88;
	/* 0x8C */ u32 unk8C;
	/* 0x90 */ u32 unk90;
	/* 0x94 */ u32 unk94;
	/* 0x98 */ u32 unk98;
	/* 0x9C */ u32 unk9C;
	/* 0xA0 */ u32 unkA0;
};

extern Particle_LevelUpStars Particle_LevelUpStars;

void MagneticImpulse::levelUpStars(const Player &player) {
	auto *particles = reinterpret_cast<LevelUpStarsObject1 *>(SetTask(func_Particle_Task, ObjectGroups::Particle, Object1Sizes::x80)->object);
	particles->unk72 = player.index;
	particles->unk0 = Particle_LevelUpStars.unk74;
	particles->unk4 = Particle_LevelUpStars.unk78;
	particles->unk8 = Particle_LevelUpStars.unk7C;
	particles->unk30 = Particle_LevelUpStars.unk98;
	particles->unk34 = Particle_LevelUpStars.unk9C;
	particles->unk38 = Particle_LevelUpStars.unkA0;
	particles->unk3C = Particle_LevelUpStars.unk8C;
	particles->unk40 = Particle_LevelUpStars.unk90;
	particles->unk44 = Particle_LevelUpStars.unk94;
	particles->unk10 = Particle_LevelUpStars.unk80;
	particles->unk14 = Particle_LevelUpStars.unk84;
	particles->unk18 = Particle_LevelUpStars.unk88;
	particles->unk48 = &player.x;
	particles->unk60 = &Particle_LevelUpStars;
