#pragma once

#include "context.hpp"

global f32 gf32_SystemHzAdd1;

struct LevelTypeStats {
	/* 0x0 */ f32 unk0;
	/* 0x4 */ f32 unk4;
	/* 0x8 */ f32 unk8;
	/* 0xC */ f32 unkC;
	/* 0x10 */ f32 unk10;
	/* 0x14 */ f32 unk14;
	/* 0x18 */ f32 unk18;
};

struct TypeStats {
	LevelTypeStats stats[3];
	/* 0x54 */ f32 unk54;
	/* 0x58 */ f32 unk58;
	/* 0x5C */ f32 unk5C;
	/* 0x60 */ f32 unk60;
};

constexpr TypeStats StatPresets[3] = {
		{{{0.462962955236435, 0.717592597007751, 0.75,              0.00385802472010255, 0.000848765426781028, 0.000308641989249736, 50}, {0.462962955236435, 0.717592597007751, 0.810185194015503, 0.00385802472010255, 0.000848765426781028, 0.000308641989249736, 70}, {0.532407402992249, 0.736111104488373, 0.870370388031006, 0.00441358052194119, 0.000563271576538682, 0.000540123437531292, 70}}, 0.800000011920929, 0.0253072753548622, 0.00959931127727032, 0.00261799385771155},
		{{{0.648148119449615, 0.671296298503876, 0.717592597007751, 0.00555555615574121, 0.000254629616392776, 0.000123456789879128, 40}, {0.648148119449615, 0.671296298503876, 0.777777791023254, 0.00555555615574121, 0.000794753083027899, 0.000123456789879128, 60}, {0.671296298503876, 0.717592597007751, 0.837962985038757, 0.00624999590218067, 0.00115740741603076,  0.000231481477385387, 60}}, 0.899999976158142, 0.0253072753548622, 0.00959931127727032, 0.00261799385771155},
		{{{0.370370358228683, 0.671296298503876, 0.731481492519379, 0.0030864195432514,  0.000895061704795808, 0.000578703708015382, 80}, {0.462962955236435, 0.671296298503876, 0.791666686534882, 0.00385802472010255, 0.000640432117506862, 0.000192901221453212, 80}, {0.462962955236435, 0.671296298503876, 0.851851880550385, 0.00385802472010255, 0.000640432117506862, 0.000578703708015382, 90}}, 0.800000011920929, 0.0253072753548622, 0.00959931127727032, 0.00261799385771155},
};

constexpr f32 CharacterWeights[TotalCharacterAmount] = {
		1.1f,    //sonic
		0.9f,    //tails
		1.4f,    //knuckles
		1.05f,    //amy
		1,        //jet
		1.45f,    //storm
		0.95f,    //wave
		1.55f,    //eggman
		0.8f,    //cream
		1.3f,    //rouge
		1.15f,    //shadow
		0.75f,    //super sonic
		0.85f,    //nights
		1.02f,    //aiai
		1.2f,    //ulala
		1.25f,    //e10g
		1.35f,    //e10r
		1.05f,    // silver
		1.1f,    // metal sonic
		1.15f,    // emerl
		1.05f,    // blaze
		1.4f,    // chaos
		0.9f,    // tikal
};

constexpr f32 BoostArchetypeBoostSpeeds[3] = {
		pSpeed(1.1), pSpeed(2.1), pSpeed(3.1)
};

constexpr f32 EmerlTopSpeedBonus[3] = {
		pSpeed(20), pSpeed(15), pSpeed(5)
};

struct FakePlayerStruct {
	PlayerGearStats stats[3];
	/* 0xA8 */ s32 unkA8;
	/* 0xAC */ s32 unkAC;
	/* 0xB0 */ s32 unkB0;
	/* 0xB4 */ s32 unkB4;
	/* 0xB8 */ f32 unkB8;
	/* 0xBC */ f32 unkBC;
	/* 0xC0 */ f32 unkC0;
	/* 0xC4 */ f32 unkC4;
	/* 0xC8 */ f32 unkC8;
	/* 0xCC */ f32 unkCC;
	/* 0xD0 */ f32 unkD0;
	/* 0xD4 */ f32 unkD4;
	/* 0xD8 */ f32 unkD8;
	/* 0xDC */ f32 unkDC;
	/* 0xE0 */ f32 unkE0;
	/* 0xE4 */ f32 unkE4;
	/* 0xE8 */ s32 unkE8;
	/* 0xEC */ f32 unkEC;
	/* 0xF0 */ f32 unkF0;
	/* 0xF4 */ f32 unkF4;
	/* 0xF8 */ u32 unkF8;
	/* 0xFC */ f32 unkFC;
};